In [1]:
%matplotlib inline

In [2]:
import qgrid
import pandas as pd

## Load in required functions

In [3]:
from customer_segmentation import rfm_analysis,kmeans_analysis
from data_cleanup import read_csv, join_dataset

In [4]:
# general concepts

In [5]:
read_csv('email_list.csv').head(2)

               email adres  CustomerID
0  gorczany.gwen@gmail.com       17850
1  yundt.krystel@klein.net       13047

In [6]:
1 * 2

2

In [7]:
variable_1 = 1 * 2

In [8]:
def multiply_by2(x):
    b = 2 * x
    print(b)

In [9]:
multiply_by2(5)

10

# basic concepts

In [10]:
read_csv('crm_data.csv', sep=';', decimal='.').head(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,TotalPrice
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34

In [11]:
read_csv('email_list.csv').head(2)

               email adres  CustomerID
0  gorczany.gwen@gmail.com       17850
1  yundt.krystel@klein.net       13047

In [12]:
df = read_csv('crm_data.csv', sep=';', decimal='.')
df.head(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,TotalPrice
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34

In [13]:
df_1 = read_csv('email_list.csv', sep=';')
df_1.head(2)

               email adres  CustomerID
0  gorczany.gwen@gmail.com       17850
1  yundt.krystel@klein.net       13047

In [14]:
df['CustomerID'] =df['CustomerID'].astype(int)

## Check data

In [15]:
df.head(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,TotalPrice
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

In [16]:
join_dataset(df,df_1, join_key='CustomerID').head(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,TotalPrice,email adres
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30,gorczany.gwen@gmail.com
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,gorczany.gwen@gmail.com

### Apply RFM function & check # of clusters

In [17]:
test = rfm_analysis(df)
test.head(2)

,days_since_last_order,frequency,total_revenue,r_quartile,f_quartile,m_quartile,RFMScore
CustomerID,,,,,,,
12346,326,1,77183.6,4,4,1,441
12347,2,182,4310.0,1,1,1,111

### Refine clusters with Kmeans cluster model

In [18]:
segments = kmeans_analysis(test,n_clusters=4)

          days_since_last_order   frequency  total_revenue
clusters
0                    190.411379   17.690737     313.763678
1                     17.525931  209.415632    4774.490980
2                     24.193902   28.704878     691.524659
3                    123.942234   81.440308    1768.818397

In [19]:
segments.head(2)

,days_since_last_order,frequency,total_revenue,r_quartile,f_quartile,m_quartile,RFMScore,clusters
CustomerID,,,,,,,,
12346,326,1,77183.6,4,4,1,441,3
12347,2,182,4310.0,1,1,1,111,1

In [20]:
### What are we missing?

In [21]:
segments = segments.reset_index()

In [22]:
### How to join the mail data?

In [23]:
join_dataset(segments,df_1, join_key='CustomerID').head(2)

,CustomerID,days_since_last_order,frequency,total_revenue,r_quartile,f_quartile,m_quartile,RFMScore,clusters,email adres
0,12346,326,1,77183.6,4,4,1,441,3,branson63@mcglynn.com
1,12347,2,182,4310.0,1,1,1,111,1,hammes.dayana@hotmail.com

In [24]:
joined_dataset = join_dataset(segments,df_1, join_key='CustomerID')

### Display customer selection table

In [25]:
qgrid_widget = qgrid.show_grid(joined_dataset)
qgrid_widget

QgridWidget(grid_options={'fullWidthRows': True, 'syncColumnCellResize': True, 'forceFitColumns': True, 'defauâ€¦

In [35]:
qgrid_widget.get_changed_df().to_csv('mailfile.csv', sep=';')